app/controllers/clients_controller.rb

SELECT * FROM "clients"
---
  def index
    @clients = Client.all

SELECT * FROM "clients" WHERE ("clients"."id" = 1)
---
  def show
    @client = Client.find(params[:id])

SELECT * FROM "clients" WHERE ("clients"."id" = 1)
---
  def edit
    @client = Client.find(params[:id])

INSERT INTO "clients" ("name", "latitude", "created_at", "updated_at", "url", "phone_number", "media", "longitude") VALUES('test', 40.714224, '2010-08-10 18:13:25', '2010-08-10 18:13:25', 'test.com', '0123456789', '', -73.961452)
---
  def create
    @client = Client.new(params[:client])

    respond_to do |format|
      if @client.save

SELECT * FROM "clients" WHERE ("clients"."id" = 1)
UPDATE "clients" SET "updated_at" = '2010-08-10 19:41:44', "longitude" = 2.3500443681640704, "latitude" = 48.85727532065469 WHERE "id" = 1
---
  def update
    @client = Client.find(params[:id])

    respond_to do |format|
      if @client.update_attributes(params[:client])